[
  {
    "date": "2022-08-18",
    "title_en": "Schedule Is In The Wild",
    "meta_en": "After thorough consideration of the calendars and requirements of our speakers with regards to our own capabilities we have prepared likely the best of the possible programs. The schedule is already public and can be found on our website. Do not hesitate and start planning your own schedule to choose the talks you cannot miss.",
    "title_sk": "Zverejili sme program",
    "meta_sk": "Po zohľadnení kalendárov a požiadaviek našich speakerov a možností konferenčných priestorov sme vyskladali najlepší možný program. Program je už zverejnený na našom webe, môžete si teda začať vyberať prednášky, ktoré si nechcete nechať ujsť.",
    "categories": ["conference"],
    "url": "/en/saturday.html"
  },
  {
    "date": "2022-07-11",
    "title_en": "Call for Proposals closed",
    "meta_en": "The call for proposals has been closed. In the next few days the PyCon SK commission will decide which talks will be presented at the conference. Thank you all for the well prepared submissions, unfortunately we only have limited amount of time slots so we will have to choose just a few of them. We have received dozens of high-quality proposals, so the decision is not going to be an easy one. Once the selection process is finished, all proposers will be notified regardless of the acceptance status of their submission.",
    "title_sk": "Návrhy na prednášky sú uzavreté",
    "meta_sk": "Predkladanie návrhov na prednášky bolo uzavreté. V najbližších dňoch komisia rozhodne, ktoré prednášky dostanú na konferencii priestor. Ďakujeme predkladateľom za výborne pripravené návrhy, žiaľ priestor na konferencii je obmedzený a preto budeme musieť vybrať iba niektoré z nich. Nakoľko sme dostali desiatky kvalitných a  zaujímavých návrhov, naša komisia nebude mať výber jednoduchý. Po uzavretí výberového procesu budú s výsledkami oboznámení všetci predkladatelia bez ohľadu na to, či ich návrh bol prijatý alebo nie.",
    "categories": ["speakers"],
    "url": "/en/program/index.html"
  },
  {
    "date": "2022-06-15",
    "title_en": "Ticket sales for PyCon SK 2022 are open!",
    "meta_en": "As you might know, the PyCon SK conference was moved from 2020 and a large part of the people had purchased a ticket for the original conference date. As anti-pandemic measures were still in place at the time of the launch of this year's conference, which limited the capacity of mass events, we decided not to sell any more tickets.\n \nCurrently, capacity restrictions at mass events are lifted and we are reopening ticket sales. We firmly believe that the favorable pandemic situation will continue in early September. However, we care about the health of all participants, so we decided to sell additional tickets with a potential restriction. Should it be necessary to reduce the capacity of the conference due to pandemic measures, the tickets from the current sale will be canceled. Holders of such tickets will have access to the live stream from the conference and at the same time an aliquot of the ticket price will be refunded.\n \nWe thank all members of the Python community for their interest and support. We look forward to seeing you on September 9-11 in Bratislava!",
    "title_sk": "Dopredaj lístkov na PyCon SK 2022 je otvorený!",
    "meta_sk": "Ako iste viete, konferencia PyCon SK bola presunutá z roku 2020 a veľká časť ľudí mala zakúpený lístok už na pôvodný termín konferencie. Keďže v čase spustenia organizácie najbližšieho ročníka konferencie boli ešte v platnosti protipandemické opatrenia, ktoré obmedzovali kapacitu hromadných podujatí, rozhodli sme sa dočasne nepredávať ďalšie lístky.\n \nAktuálne sú kapacitné obmedzenia na hromadných podujatiach zrušené a znovu preto otvárame predaj lístkov. Pevne veríme, že priaznivá pandemická situácia bude pretrvávať aj začiatkom septembra. Záleží nám však na zdraví všetkých účastníkov a účastníčok a preto sme sa rozhodli predávať dodatočné lístky s potenciálnym obmedzením. Ak by z dôvodu pandemických opatrení bolo potrebné znížiť kapacitu konferencie, stornované budú práve lístky zo súčasného dopredaja. Držitelia takýchto lístkov budú mať prístup k live streamu z konferencie a zároveň im bude alikvotná časť z ceny lístka vrátená.\n \nĎakujeme všetkým členom a členkám Python komunity za prejavený záujem a podporu. Ťešíme sa na Vás 9. až 11. septembra v Bratislave!",
    "categories": ["tickets"],
    "url": "/en/tickets.html"
  },
  {
    "date": "2022-06-13",
    "title_en": "Announcing first speakers",
    "meta_en": "We are glad to announce the first speakers at PyCon SK 2022. If you want to see your photo among the speakers, do not hesitate and submit your talk proposal.",
    "title_sk": "Ohlásenie prvých rečníkov",
    "meta_sk": "Sme radi že môžeme ohlásiť prvých rečníkov na našej konferencii. Ak sa chcete pripojiť a uvidieť aj Vašu fotku medzi rečníkmi neváhajte a prihláste svoj príspevok.",
    "categories": ["speakers"],
    "url": "/en/speakers/index.html"
  },
  {
    "date": "2022-05-18",
    "title_en": "Why are all the tickets sold out? Will they still be on sale?",
    "meta_en": "The conference was rescheduled from 2020 due to the spread of COVID-19, where we had sold out most of the tickets and those tickets remain valid. Currently, owners can return these tickets if the date of this year's conference is not convenient for them. Therefore, we anticipate that there will be a very limited number of tickets available.\nIf you are interested in a ticket please sign up on the list in the Tickets section. We will be putting a limited number of tickets on sale and people on the list will receive an email notification in advance of the start of the sale.",
    "title_sk": "Prečo sú všetky lístky vypredané? Budú ešte v predaji?",
    "meta_sk": "Konferencia bola presunutá z roku 2020 pre šírenie nákazy COVID-19, kde sme mali vypredanú väčšinu lístkov a tieto lístky ostali v platnosti. V súčasnosti môžu vlastníci tieto lístky vrátiť, ak im nevyhovuje termín tohtoročnej konferencie. Preto predpokladáme, že bude k dispozícii veľmi obmedzený počet lístkov.\nPokiaľ máte záujem o lístok zapíšte sa prosím na zoznam v sekcii Lístky. Budeme dávať do predaja obmedzený počet lístkov a ľudia na zozname dostanú emailom upozornenie na spustenie predaja v predstihu.",
    "categories": ["tickets"],
    "url": "/en/tickets.html"
  },
  {
    "date": "2022-03-13",
    "title_en": "Donate your 2% to SPy",
    "meta_en": "Besides PyCon SK, our non-profit organisation actively supports Slovak ICT teachers, mainly by organising workshops and creating teacher content. Please, consider supporting us by donating your 2% of your paid tax (applicable only to Slovak tax payers).",
    "title_sk": "Dve percentá pre SPy",
    "meta_sk": "Okrem konferencie PyCon SK naše občianske združenie organizuje aj projekt Učíme s Hardvérom, v rámci ktorého sa nám podarilo dostať micro:bity na vyše 300 základných a stredných škôl, vyškolili sme približne 750 učiteľov a naše aktivity zasiahli vyše 10 000 žiakov a žiačok. Ak by ste nás chceli v týchto aktivitách podporiť, zvážte darovanie vašich 2%",
    "categories": [],
    "url": "https://python.sk/daruj/"
  },
  {
    "date": "2022-03-09",
    "title_en": "The Call for Proposals is open!",
    "meta_en": "Do you know anyone in underrepresented group in IT who would like to do a conference talk? Let us know, and try to encourage him/her to submit Call for Proposals for PyCon SK 2022. We are trying to support diversity. Anyone can be part of the conference.",
    "title_sk": "Predkladanie prednášok a workshopov je otvorené!",
    "meta_sk": "Poznáš niekoho z málo zastúpenej skupiny v IT, kto by chcel urobiť prednášku na konferencii? Daj nám vedieť a povzbuď ho/ju, aby si podal/a návrh na prednášku na PyCon SK 2022. Snažíme sa podporovať rôznorodosť.",
    "categories": ["speakers"],
    "url": "/en/cfp.html"
  },
  {
    "date": "2022-03-09",
    "title_en": "PyCon SK 2022",
    "meta_en": "Due to the COVID-19 situation PyCon SK 2020, 2021 was postponed. We are happy to announce that PyCon SK 2022 will happen 9-11. September 2022. For more details subscribe to our Newsletter.",
    "title_sk": "PyCon SK presunutý na rok 2022",
    "meta_sk": "Vzhľadom na pretrvávajúcu pandemickú situáciu sa PyCon SK 2020, 2021 neuskutočnil. Sme veľmi radi, že môžeme oznámiť PyCon SK 2022 bude 9-11. Septembra 2022. Pre viac info sa prihláste na odber nižšie.",
    "categories": ["conference"]
  }
]
